package ch01;

public class DataStructure {

}
/*
 자료구조
 - 프로그래밍에서 사용할 많은 데이타를 메모리 상에서 관리하는 여러 구현방법들
 - 효율적인 자료구조가 성능 좋은 알고리즘의 기반이 됨
 - 자료의 효율적인 관리는 프로그램의 수행속도와 밀접한 관련이 있음
 - 여러 자료 구조 중에서 구현하려는 포르그램에 맞는 최적의 자료구조를 활용해야 하므로 자료구조에 대한 이해가 중요
 
 자료구조 종류
 -- 한 줄로 자료를 관리하기(선형 자료구조)
 배열(array)-> 선형으로 자료를 관리, 정해진 크기에 메모리를 먼저 할당받아 사용하고, 자료의 물리적 위치와 논리적 위치가 같음
 ! 배열은 중간이 비면 안됨
 
 연결 리스트(linkedlist)-> 선형으로 자료를 관리, 자료가 추가될 때마다 할당 받고, 자료는 링크로 연결됨. 자료의 물러직 위치와 논리적 위치가 다를 수 있음
 
 스택(stack): 가장 나중에 입력 된 자료가 가정 먼저 출력되는 자료 구조(Last In first Out)
 큐(Queue) : 가장 먼저 입력 된 자료가 가장 먼저 출력되는 자료 구조
 
 */